import 'package:mis_project/models/process_step.dart';

class ProcessStepService {
  static List<ProcessStep> getSteps() {
    return [
      ProcessStep(
        id: '1',
        title: 'Пријава',
        validator: 'ментор',
        description:
            'Менторот, по договор со студентот, ја пополнува формата за нова пријава, достапна на линкот "Нова пријава". Се пополнуваат полињата за Тема, Област и Кратка содржина. Дополнително, Член 1 содржи листа само на професори, а Член 2 содржи листа на асистенти и професори. Системот праќа известување по електронска пошта до студентот.',
      ),
      ProcessStep(
        id: '2',
        title: 'Прифаќање на темата од студентот',
        validator: 'студент',
        description:
            'Студентот се согласува со пријавената тема. Системот праќа известување по електронска пошта до менторот и службата за студентски прашања.',
      ),
      ProcessStep(
        id: '3',
        title: 'Валидирање од службата за студентски прашања',
        validator: 'студентска служба',
        description:
            'Службата за студентски прашања проверува дали студентот исполнува услови за пријава на тема (освоени 140 односно 200 ЕКТС, запишан предмет "Дипломска работа" во тековниот или минатиот семестар). Системот праќа известување по електронска пошта до студентот, менторот и членовите во комисија. Доколку условите не се исполнети, пријавата останува во оваа состојба до нивно исполнување.',
      ),
      ProcessStep(
        id: '4',
        title: 'Одобрение за оценка од ментор',
        validator: 'ментор',
        description:
            'Во моментот кога менторот е задоволен со изработената работа и напишаниот текст, истиот го прикачува кон пријавата, со што истата станува видлива и за членовите на комисијата. Системот праќа известување по електронска пошта до студентот и членовите во комисија.',
      ),
      ProcessStep(
        id: '5',
        title: 'Забелешки од комисија',
        validator: 'член, ментор',
        description:
            'Членовите од комисијата во рок од 3 работни дена ја прегледуваат верзијата од дипломската работа и доколку се задоволни го потврдуваат статусот, а во спротивно внесуваат забелешка. Не преземањето на овој чекор од страна на членовите во предвиденио рок, се смета за прифаќање без забелешки. Доколку менторот го валидира статусот, валидацијата ќе биде во име на членовите од комисијата. Системот праќа известување по електронска пошта до студентот, менторот и службата за студентски прашања.',
      ),
      ProcessStep(
        id: '6',
        title: 'Валидирање на услови за одбрана',
        validator: 'студентска служба',
        description:
            'Службата за студентски прашања врши проверка дали се исполнети условите за одбрана (положени и евидентирани сите испити). Доколку овој услов не е исполнет, студентот се известува по електронска пошта да ги собере пријавите кои недостасуваат. По исполнувањето на овој услов, се испраќа известување по електронска пошта до студентот, менторот и членовите во комисија со потребните документи за одбрана на дипломската.',
      ),
      ProcessStep(
        id: '7',
        title: 'Одбрана',
        validator: 'ментор',
        description:
            'Менторот пристапува до системот за преглед и резервација на простории, резервира просторија за во одреден термин, потоа го внесува терминот и просторијата и ја закажува одбраната. Се испраќа известување по електронска пошта до студентот, менторот и членовите во комисија со потребните документи и деталите (време и место) за одбрана на трудот. Студентот од системот за дипломски ги симнува и печати сите потребни документи (записник за јавна одбрана), и ги носи со себе на денот на одбрана заедно со пријава за испит и индекс.',
      ),
      ProcessStep(
        id: '8',
        title: 'Архива',
        validator: 'продекан за настава',
        description: '',
      ),
    ];
  }
}
