import 'package:mis_project/models/thesis_model.dart';

class ThesisService {
  static List<Thesis> getThesis() {
    return [
      Thesis(
          id: '1',
          title:
              'Дизајн, архитектура и еволуција на софтверско решение за директен маркетинг на платформата LinkedIn',
          status: "Архива",
          studentId: '211033',
          student: 'Sandra Georgiev',
          date : "17.06.2023",
          credits : "200",
          description:
              'Во овој дипломски труд труд е претставено софтверско решение кое овозможува директен маркетинг на социјалната мрежа LinkedIn. Решението дозволува поврзување на повеќе LinkedIn профили, менаџирање на истите, автоматизација на одредени акции (како поврзување, пишување пораки, интеракција со содржини) и работа со LinkedIn поштенските сандачиња на повеќе профили одеднаш. Во дипломскиот труд ќе биде опишано како решението го автоматизира пристапот до LinkedIn, како истите процеси се скалирани на илјадници профили што не е возможно со мануелно работење. Направена е компаративна анализа на ова решение со слични проекти како и еволуцијата на истото од прототип до продукт со значаен број на корисници.'),
      Thesis(
          id: '2',
          title:
              'Secure Payment Confirmation – Употреба на passkeys за автентикација на платежни трансакции',
          status: "Архива",
          studentId: '211136',
          student: 'Andrej Vlahovski',
          date : "17.06.2023",
          credits : "200",
          description:
              'Целта на дипломскиот труд е да ја претстави употребата на passkeys за автентикација на платежни трансакции преку ново предложениот стандарт за автентикација Secure Payment Confirmation. Низ дипломскиот труд се разгледуваат еволуцијата на протоколите за автентикација без употреба на password базиран на Public Key Cryptography (FIDO2), протоколот за автентикација на платежни трансакции базирани на платежни картичка (EMV 3-D Secure) и правните тела/закони коишто ги регулираат. Дополнително, се разгледуваат лимитациите на моменталните протоколи за автентикација во екосистемот на плаќања, како и нивните проширувањата и подобрувањата со што би се допринело до можноста за употреба на Secure Payment Confirmation протоколот за автентикација на платежни трансакции.'),
      Thesis(
          id: '3',
          title:
              'Платформа за е-трговија „Neura Cartix“ базирана на вештачка интелигенција',
          status: "Архива",
          studentId: '201107',
          student: 'Jovana Cocevska',
          date : "17.06.2023",
          credits : "200",
          description:
              'Целта на овој дипломски труд е развој на веб платформа за е-трговија „Neura Cartix“. Односно, станува збор за развој на систем кој истовремено ќе овозможува функционалности на електронска продавница и функционалности кои се однесуваат на прегледите на сите нарачки и внатрешната организација на самата компанија. Исто така, системот ќе нуди поддршка за разгледување на производите, додавање во пазарна кошничка и реализација на наплата. Воедно, ќе располага со опции за менаџирање со документи (import и export на документи) во тековното работење на команијата. Како исклучителна предност оваа апликација ќе располага со алатка базирана на вештачка интелигенција наменета за препораки на производи според преференците на корисникот. Конечно, овој дипломски труд се стреми да додаде нова димензија кон веќе постоечкиот свет на електронската трговија со неопходните функционалности и интеграцијата на вештачката интелигенција.'),
      Thesis(
          id: '4',
          title:
              'Гејмификацијата како моќна алатка за зголемување на продуктивноста',
          status: "Архива",
          studentId: '192011',
          student: 'Aleksandra Petrovska',
          date : "17.06.2023",
          credits : "200",
          description:
              '	Во денешната ера на брз технолошки развој, многу луѓе се соочуваат со потешкотии во одржувањето на високо ниво на продуктивност. Во овој дипломски труд ќе се истражи како гејмификацијата - интегрирање на елементи од игри во неигриви контексти - може значително да помогне во надминување на овие предизвици. Ќе бидат анализирани различни апликации за продуктивност кои вклучуваат карактеристики на гејмификација, истражувајќи ја нивната примена во области како што се работното место, образованието и личниот развој. Преку истражување на тоа како елементи како поени, ранг-листи, предизвици и награди ги мотивираат корисниците, трудот ќе ја истакне ефикасноста на овие методи во подобрување на перформансите и ангажираноста.'),
      Thesis(
          id: '5',
          title:
              'Споредбена анализа на Jira и YouTrack: Алатки за управување со проекти и следење на задачи',
          status: "Архива",
          studentId: '203099',
          student: 'Ana Trpevska',
          date : "17.06.2023",
          credits : "200",
          description:
              '	Oваа дипломска работа има за цел да ги спореди Jira и YouTrack, две популарни алатки за управување со проекти и следење на задачи. Дипломската ќе се состои од анализа која ќе ги разгледа нивните карактеристики, функционалности, кориснички интерфејс, интеграција со други системи, прилагодливост, перформанси и трошоци. Целта е да се утврди која алатка е поефикасна и попогодна за различни типови на организации и проекти.'),
      Thesis(
          id: '6',
          title: 'iOS апликација - hobby tracker',
          status: "Архива",
          studentId: '211063',
          student: 'Filip Avramoski',
          date : "17.06.2023",
          credits : "200",
          description:
              '	Во оваа дипломска работе е опфатена изработка на iOS мобилна апликација во SwiftUI & CoreData за тракирање/дневник за хобија. Тоа вклучува: записник за фитнес (што е вежбано тој ден, тежина и сл.), планер за серии (кога излегуваат нови, која епизода е последно гледана), тракер за видео игри (колку време се игра и белешки во случај на загатки во истите), и тракер за читање книги (колку страници во еден ден и до која е стигнато). Сите податоци имаат своја категорија, па апликацијата служи како 4-во-1 алатка. Сите се запишани локално и служат чисто за корисникот да ги следи своите навики. Секако, има простор за подетална аналитика и споделување со што би добила и социјален елемент, како и вметнување разни сервиси / ВИ за препораки.'),
      Thesis(
          id: '7',
          title: 'Веб платформа за аукции базирана на word press',
          status: "Архива",
          studentId: '211111',
          student: 'Sandra Georgiev',
          date : "17.06.2023",
          credits : "200",
          description:
              'Во оваа дипломска работа ќе се создаде платформа базирана на WordPress за прикажување и аукција на уметнички дела. Веб-страницата ќе има интерактивна галерија за гледање висококвалитетни уметнички слики со соодветен детален опис. Притоа, ќе биде интегриран систем за аукција за да се овозможи наддавање, со автоматизирани временски ограничувања и известувања за известување. Платформата ќе вклучува регистрација на кориснички профили за уметници, купувачи и куратори, овозможувајќи персонализирана интеракција. Дизајнот ќе биде респонзивен и ќе овозможи непречено користење на платформата од компјутер и мобилни уреди.'),
      Thesis(
          id: '8',
          title:
              'Анализа на иновацијата, бизнис моделот и начин на примена на ИKT во Bose',

          status: "Архива",
          studentId: '212222',
          student: 'Andrej Vlahovski',
          date : "17.06.2023",
          credits : "200",
          description:
              'Целта на овој дипломски труд е да ги објасни иновациските практики, бизнис моделот и интеграцијата на информациско-комуникациските технологии во рамките на компанијата Bose, глобален лидер во областа на аудио-технологијата. Преку преглед на историскиот развој на компанијата и нејзините значајни иновации, се оценува како Bose ги користи ИКТ за да ги подобри своите производи и да создаде конкурентска предност на пазарот. Анализата на бизнис моделот се фокусира на основните компоненти како што се создавањето вредност, каналите на дистрибуција, и односите со клиентите, со посебен акцент на улогата на ИКТ во дигиталната трансформација и развојот на нови производи и услуги.'),
      Thesis(
          id: '9',
          title: 'Имплементација на сајбер безбедност во големи организации',
          status: "Архива",
          studentId: '213333',
          student: 'Jovana Cocevska',
          date : "17.06.2023",
          credits : "200",
          description:
              '	Детален преглед и анализа на сајбер безбедноста како посебна гранка од сферата на компјутерските науки и нејзината улога во денешниот дигитален свет. Објаснување на главните елементи и принципи кои се составен дел од сајбер безбедноста како и набројување на најдобрите начини и практики за имплементација и одржување на безбедноста во големи компании.'),
      Thesis(
          id: '10',
          title: 'ChefsFeed: веб апликација за рецепти',
          status: "Архива",
          studentId: '214444',
          student: 'Aleksandra Petrovska',
          date : "17.06.2023",
          credits : "200",
          description:
              'ChefsFeed e aпликација која ќе овозможи корисниците да поставуваат, ажурираат и бришат свои рецепти, како и да заследуваат или одследуваат други корисници. Исто така, ќе имаат можност да прегледуваат, оценуваат и коментираат рецепти. Рецептите ќе бидат категоризирани и ќе имаат нивоа на тежина на готвење, што ќе овозможи филтрирање. Дополнително, ќе постои и поле за пребарување на рецепти и корисници.'),
      Thesis(
          id: '11',
          title:
              'Употреба на технологии и стандарди во Македонскиот веб простор',
          status: "Архива",
          studentId: '215555',
          student: 'Ana Trpevska',
          date : "17.06.2023",
          credits : "200",
          description:
              'Во рамки на дипломската работа ќе се истражи состојбата на веб сајтовите кои се дел од македонскиот веб простор. За таа цел ќе се анализира употребата на различните веб технологии, сигурносните аспекти како и технологиите за пристапност кои се во употреба. Преку детална анализа на јавните параметри и употреба на алатки за автоматско тестирање, ќе се оцени состојбата на сајтовите од македонскиот веб простор, со посебен осврт на сајтовите кои се дел од јавната админстрација. Резултатите од оваа анализа можат да бидат корисни за подобро мапирање на степенот на развој и конформитет кон веќе воспоставените веб технологии.'),
      Thesis(
          id: '12',
          title: 'Пристапи за симулација на колизија на меки тела',
          status: "Архива",
          studentId: '216666',
          student: 'Filip Avramoski',
          date : "17.06.2023",
          credits : "200",
          description:
              '	Симулацијата на колизија на меки тела е техника која се користи во видео игри и филмови за реалистична репрезентација нa објекти кои може да се деформираат. Пример за вакви тела се: мускули, облека, коса, желатин, гума и слично. Дополнително, симулациите се користат и за истражувачки цели во биомеханика, медицина, роботика и инженерство. Во рамките на овој труд ќе се дизајнира и имплементира систем за симулација на колизија на меки тела во реално време. Ќе се проучат различните техники за симулирање на меки тела и физичките принципи врз кои се потпираат симулациите, по што ќе се имплементира систем за интерактивен приказ на симулациите. Поради комплексноста на симулациите, ќе се истражат и имплементираат начини за оптимизација на пресметките за подобрување на перформанси.'),
    ];
  }

  static Thesis getThesisById(String id) {
    return getThesis().firstWhere((thesis) => thesis.id == id);
  }

  static Thesis? getThesisByStudentId(String studentId) {
    try {
      return getThesis().firstWhere((thesis) => thesis.studentId == studentId);
    } catch (e) {
      return null;
    }
  }
}
